# How to lookup for a particular transaction on a bank statement and then add them up.  

First we will import the data as csv, then lookup the transactions based on a description keyword. The csv file looked like this

Date","Description","Comments","Check Number","Amount","Balance"

"05/06/2016","GOLDEN STATE WTR   ONLINE PMT  ID  1061291316 CO  GOLDEN STATE WTR   ACH ECC WEB   ACH Trace 042000011342940","","","($126.41)","$6,618.45"
"05/09/2016","AMEX EPAYMENT   ACH PMT  ID  0005000008 CO  AMEX EPAYMENT   ACH ECC WEB   ACH Trace 091000034739514","","","($1,973.58)","$4,644.87"

In [136]:
import pandas as pd
df = pandas.read_csv('/Users/boneyjose/Downloads/dl 139020_0003565564-S0220170525.csv')
df.head(2)

,Date,Description,Comments,Check Number,Amount,Balance
0,05/06/2016,GOLDEN STATE WTR ONLINE PMT ID 1061291316 ...,NaN,NaN,($126.41),"$6,618.45"
1,05/09/2016,AMEX EPAYMENT ACH PMT ID 0005000008 CO AM...,NaN,NaN,"($1,973.58)","$4,644.87"

In [127]:
df_transaction=df[df['Description'].str.contains("CITI")]

In [128]:
df_amount=df_transaction.loc[:,('Amount')]

Convert all currency formated values to a float value

In [129]:
df_amount = df_amount.str.replace(',', '')
df_amount = df_amount.str.replace('$', '')
df_amount.head(3)

3     1478.07
6     1488.08
11    1478.05
Name: Amount, dtype: object

Convert the String values to Float

In [130]:
dfclean = df_amount.astype(float)
dfclean.head(3)

3     1478.07
6     1488.08
11    1478.05
Name: Amount, dtype: float64

 Now add them up.

In [131]:
dfclean.sum()

39590.27